---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterWarn
source: html/bf2d3043-4297-e40e-bd8b-54cf2e39eec9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateGutterWarn Property

Could not create Gutter. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateGutterWarn { get; }
```